export default {
  direction: 'rtl',
  pages: {
    index: 'الصفحة الرئيسية',
    signup: 'التسجيل'
  },
  texts: {
    public: {},
    done: {
      title: 'تم التسجيل',
      registrationDone:'لقد تم تسجيلك بنجاح 🥳 ، يرجى الإنتظار حتى يتم مراسلتك وقبولك',
      backHome:'رجوع للصفحة الرئيسية'

    },
    index:{
      registrationDone:'لقد تمت عملية التسجيل بنجاح  ، سنقوم بالتواصل معكم قريبا',
      navbarlinks:{
        about:'حول',
        prizes:'الجوائز',
        partners:'الشركاء',
        sponsors:'الممولين',
        agenda:'رزنامة',
        faq:'أسئلة متكررة',
        contact:'تواصل معنا',
        registration:'التسجيل',
        soon:'سيكون قريبا',
        registrationFull:'التسجيل سيكون قريبا',
      },
      sectionInto:{
        hackforalgeria1:'تسابق من أجل',
        hackforalgeria2:'الجزائر',
        registrationSection1:'سجل في الهاكاثون الآن',
        rendezvous : 'إنطلاقتنا ستكون يوم 2021/10/30',
      },
      sectionInfo:{
        title:'من أجل الهاكاثون ديزاد ... من أجل',
        titleAlgeria:'الجزائر',
        description:' الهاكاثون الأول من نوعه الذي سيقام في ولاية بسكرة تحت تنظيم جمعية بسكرة تقرأ  بداية من شهر أكتوبر 2021. ويهدف التجمع إلى إيجاد حلول تقنية مبتكرة للمشاكل المطروحة في عدة مجالات المحددة في التظاهرة.<br/>' +
          '<br/>' +
          'هاكاثون ديزاد فرصة لكل للمطورين والمبرمجين، وكذلك المصممين والمختصين في إدارة الأعمال والمشاريع والشركات الناشئة لخوض تجربة فريدة من نوعها.',
        info:'للمزيد من المعلومات تواصل معنا'
      },
      sectionFields:{
        title:'مجالات هاكاثون ديزاد',
      },
      sectionDate:{
        title:'متى سيقام الهاكاثون؟',
        description:'هاكاثون ديزاد سينطلق في 30/10/2021 وسيدوم لمدة 3 أيام لغاية يوم 01/11/2021',
        days:'أيام',
        hours:'ساعات',
        minutes:'دقائق',
        seconds:'ثواني',
      },
      sectionLocation:{
        title:'أين سيقام الهاكاثون؟',
        description:'بسكرة ، الجزائر',
        soon : 'المزيد من المعلومات سيتم نشرها مستقبلا',

      },
      sectionPrizes:{
        title1:'كل من يشارك في',
        title2:'هاكاثون ديزاد',
        title3:'فهو رابح',
        description:'جوائز بقيمة 500 ألف دينار',
        soon : 'المزيد من المعلومات سيتم نشرها مستقبلا',
      },
      sectionPartners:{
        title:'شركائنا',
      },
      sectionSponsors:{
        title:'ممولونا',
      },
      sectionAgenda:{
        title:'الرزنامة',
        soon:'قريبا !'
      },
      sectionFaq:{
        title:'أسئلة متكررة',
        soon:'إطرح سؤالك ونحن سنجيب'
      },
      sectionContact:{
        title:'تريد معرفة المزيد؟',
        contactus:'تواصل معنا!',
        email :'البريد الإلكتروني',
        phone:'رقم الهاتف',
        facebook:'الفايسبوك',

      },

    },
    signup:{
      nav:{
        back:'العودة إلى الصفحة الرئيسية',
        title:'التسجيل في هاكاثون ديزاد',

      },
      body:{
        projectDetails:'تفاصيل المشروع',

        step1:'خطوة 1 - تعريف لهاكاثون ديزاد',
        step2:'خطوة 2 - إختيار طريقة المشاركة',
        step3:'خطوة 3 - ملأ المعلومات الشخصية',
        step4:'',
        requiredFields:'إجباري ملأ كل الحقول',
        terms_condtions:'ماهو هاكاثون ديزاد',
        terms_condtions_text:'رسميا تم فتح باب التسجيل للمشاركة في هاكاثون ديزاد  📣📢<br/>' +
          '<br/>' +
          '🛑 التاريخ: <br/>' +
          '30 أكتوبر إلى غاية 01 نوفمبر 2021 <br/>' +
          '<br/>' +
          '🛑 المكان: ولاية بسكرة.<br/>' +
          '<br/>' +
          '🛑 صيغة التسجيل:<br/>' +
          '⬅️ التسجيل عبر فريق (يتكون من أربع مشاركين).<br/>' +
          '⬅️ التسجيل  الفردي (سيتم تكوين فريق بجمع أربع مشاركين مع الأولوية في الاختيار للفرق).<br/>' +
          '<br/>' +
          '🛑 طريقة المشاركة:<br/>' +
          '<br/>' +
          '⬅️اختيار التسجيل بفريق ( أربع مشاركين)، أو تسجيل فردي.<br/>' +
          '<br/>' +
          '⬅️ ملئ معلومات الشخصية للمشارك.<br/>' +
          '<br/>' +
          '⬅️ اختيار أحد المجالات التالية:<br/>' +
          '🔰الصحة<br/>' +
          '🔰الفلاحة<br/>' +
          '🔰الخدمات الإدارية والإجتماعية<br/>' +
          '🔰البيئة <br/>' +
          '🔰الثقافة <br/>' +
          '🔰 النقل<br/>' +
          '<br/>' +
          '⬅️ تقديم اسم ولمحة على المشروع المقترح لحل مشكلة ما في المجال المختار، وبالنسبة للتسجيل الفردي بعد اختيار المشاركين سيتم جمعهم في فريق واحد وتقديم مقترح لمشروعهم.<br/>' +
          '<br/>' +
          '✅ ما هو هاكاثون ديزاد لمن لا يعرفه  ؟؟<br/>' +
          '<br/>' +
          '⬅️ بشكلٍ عام يُعرّف الهاكاثون بأنه حدثٌ ومنافسة يلتقي فيها نخبةٌ من الأشخاص يشتركون فيما بينهم بالاهتمامات والمهارات لتبادل الخبرات أو حل مشكلةٍ ما في مدة زمنية محددة دون توقف كالماراتون، وقد يكون الاجتماع أيضًا لغاياتِ البدء ببناءِ مشروعٍ ما من الصفر وحتى الاحتراف.<br/>' +
          '⬅️ هاكاثون ديزاد هو الهاكاثون الأول من نوعه الذي سيقام في ولاية بسكرة تحت تنظيم جمعية بسكرة تقرأ. ويهدف التجمع إلى تطوير تطبيقات والتقنيات المهمة في الجزائر لإيجاد أفضل الحلول التقنية والرقمية للمشاكل في الميادين المذكورة سابقا عبر منافسة مرفوقة بالتكوين.<br/>' +
          '<br/>' +
          '🛑  الهاكاثون يستهدف أربع فئات :<br/>' +
          '⬅️ المبرمجين والمطورين الويب<br/>' +
          '⬅️ مصممين الغرافيكس.<br/>' +
          '⬅️ المهتمين بريادة الأعمال والشركات الناشئة.<br/>' +
          '⬅️ القيادة.<br/>' +
          '<br/>' +
          '🛑 الهاكاثون مفتوح لكل الشباب الجزائري من كل ولايات الوطن الذين تتراوح أعمارهم بين 16 سنة إلى غاية 35 سنة.<br/>' +
          '<br/>' +
          '🛑 يعرف برنامج هاكاثون ديزاد وسط تلك المنافسة بين المشاركين تقديم عدة محاضرات وورشات مختلفة تطبيقية تكوينية في الميادين التالية:<br/>' +
          '⬅️ إستعمالات الذكاء الاصطناعي.<br/>' +
          '⬅️ إستعمالات مختلف أدوات شركة قوقل (عبر خبراء من قوقل).<br/>' +
          '⬅️ مختلف المحاضرات التقنية.<br/>' +
          '⬅️ مختلف محاضرات وورشات ريادة الأعمال.<br/>' +
          '<br/>' +
          '🛑 نهدف من خلال هذه الحلول والأفكار المبتكرة في الميادين المذكورة اختيار أحسن المشاريع وتحويلها إلى شركات ناشئة بالمرافقة والتمويل رفقة مختلف شركائنا في هذا الحدث الكبير، كما نؤكد على أن الفائزين ستكون لهم فرصة الحصول مبدئيا إلى غاية اعلان مفاجئات أخرى:<br/>' +
          '⬅️ جوائز مالية.<br/>' +
          '⬅️ مرافقة واحتضان المشروع.<br/>' +
          '⬅️ هدايا متميزة.<br/>' +
          '⬅️ شهادات مشاركة من مختلف الوزرات والهيئات الرسمية.<br/>' +
          '⬅️ كيس هاكاثون ديزاد<br/>' +
          '<br/>' +
          '🛑 المشاركين من خارج ولاية بسكرة سيتم توفير كل سبل الراحة المتمثلة:<br/>' +
          '⬅️ التكفل بالمبيت في إقامة متميزة.<br/>' +
          '⬅️ التكفل الكامل بالاطعام واستراحة قهوة.<br/>' +
          '⬅️ التأمين وتكاليف أخرى.<br/>',
        acceptTM:'أقبل كل الشروط والقواعد المذكورة بالأعلى',

        continue:'متابعة',
        back:'رجوع',
        register:'تسجيل المشاركة',

        individually:'مشاركة فردية',
        team:'مشاركة جماعية ( فريق )',




        firstname_lt:'الإسم باللاتينية',
        firstname_ar:'الإسم بالعربية',
        lastname_lt:'اللقب باللاتينية',
        lastname_ar:'اللقب بالعربية',
        email:'البريد الإلكتروني',
        phoneNumber:'رقم الهاتف',
        sex:'الجنس',
        birthday:'تاريخ الميلاد',
        birthplace:'مكان الميلاد',
        wilaya:'الولاية',
        nationalID:'رقم بطاقة التعريف الوطنية',
        job:'العمل',
        studySpeciality:'التخصص الجامعي',
        participeInClub:'هل أنت منتسب إلى جمعية أو نادي؟',
        clubName:'إسم الجمعية أو النادي',
        tshirtSize:'حجم T-shirt (قميص)',
        projectField:'مجال المشروع المقترح',
        projectTitle:'عنوان المشروع',
        projectDescreption:'شرح للمشروع',
        fblink:'رابط حساب الفيسبوك',
        skillsfield:'المهارات',
        teamMember:'عضو الفريق رقم',
        teamNumber:'عدد أعضاء الفريق',
        members4:'4 أعضاء',
        members3:'3 أعضاء',

        hintfirstnamelt:'الإسم يجب أن يكون باللاتينية / الفرنسية / الإنقليزية',
        hintfirstnamear:'الإسم يجب أن يكون بالعربية',
        hintlastnamelt:'اللقب يجب أن يكون باللاتينية / الفرنسية / الإنقليزية',
        hintlastnamear:'اللقب يجب أن يكون بالعربية',


        fields:{
          health:'الصحة',
          transport:'النقل',
          agriculture:'الزراعة',
          sas:'الخدمات الإدارية والإجتماعية',
          environment:'البيئة',
          culture:'الثقافة',
        },

        skills:{
          programmer:'البرمجة والتطوير',
          designer:'تصميم غرافيكس',
          economist:'الإقتصاد',
          leadership:'القيادة',
          business:'ادارة الأعمال',
        },

        acceptPayMoney:'هل تقبل دفع مستحقات التسجيل (1000 دج لكل مشارك من بسكرة ، ومن خارج بسكرة 2000 دج) في الهاكاثون ؟',

        yes:'نعم',
        no:'لا',

        male:'ذكر',
        female:'أنثى',

        errors:{
          reqField:'هذا الحقل إجباري',
          latinName:'يقبل فقط الحروف اللاتينية (A-Z)',
          arName:'يقبل فقط الحروف العربية ( أ - ي )',
          email:'البريد الإلكتروني غير مقبول ، يرجى التحقق',
          phone:'رقم الهاتف غير مقبول ، يرجى كتابة رقم صحيح',
          nationalID:'رقم بطاقة التعريف غير مقبول ، يرجى التحقق'
        }

      },
      requestErrors:{
        emailPDuplicate:'هذا البريد مستعمل من قبل',
        phonePDuplicate:'هذا الرقم مستعمل من قبل',
        nationalIDPDuplicate:'رقم البطاقة التعريف الوطنية مستعمل من قبل',
        generalError:'هناك خطأ في عملية التسجيل ، يرجى المحاولة',
        emailPostDuplicate:'الإيميل مكرر عند أحد أعضاء الفريق',
        phonePostDuplicate:'الرقم مكرر عند أحد أعضاء الفريق',
        nationalIDPostDuplicate:'رقم بطاقة التعريف مكرر عند أحد أعضاء الفريق',
      }

    },
  }
}

